Pandas is used for data analysis
* Series
* DataFrames
* Missing Data
* GroupBy
* Merging, joining, and concatenation
* Operation
* Data Inputs and Outputs

## Series
  A Series takes attribute pd.Series(data,index)
  Shows a column hence 1-D

In [5]:
#Load the libraries
import numpy as np
import pandas as pd

## Creating a series

In [6]:
labels=['a','b','c']
my_list=[10,20,20]
arr=np.array([10,20,30])
d={'a':10,'b':20,'c':30}

In [7]:
pd.Series(data=my_list)

0    10
1    20
2    20
dtype: int64

In [8]:
pd.Series(my_list,labels)

a    10
b    20
c    20
dtype: int64

In [9]:
# Dictionary to a series
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [11]:
series1=pd.Series([1,2,3,4],index=['Mombasa','Nakuru','Kisumu','Nairobi'])
series1

Mombasa    1
Nakuru     2
Kisumu     3
Nairobi    4
dtype: int64

In [12]:
series2=pd.Series([1,2,3,4],index=['Mombasa','Nakuru','Kis','Nairobi'])
series2

Mombasa    1
Nakuru     2
Kis        3
Nairobi    4
dtype: int64

In [13]:
# Series operation
series1+series2

Kis        NaN
Kisumu     NaN
Mombasa    2.0
Nairobi    8.0
Nakuru     4.0
dtype: float64

# DataFrames

In [14]:
from numpy.random import randn
np.random.seed(101)

In [15]:
np.random.seed(101)
df=pd.DataFrame(randn(5,4), index='A B C D E'.split(), columns='W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

In [16]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
# Pass a list of column
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [18]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

## Creating a new column

In [19]:
df['Sum']=df ['W']+df['X']+df['Y']+df['Z']
df

          W         X         Y         Z       Sum
A  2.706850  0.628133  0.907969  0.503826  4.746778
B  0.651118 -0.319318 -0.848077  0.605965  0.089688
C -2.018168  0.740122  0.528813 -0.589001 -1.338233
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357
E  0.190794  1.978757  2.605967  0.683509  5.459028

In [20]:
#To return a column of random values
df['Random']=randn(5)
df

          W         X         Y         Z       Sum    Random
A  2.706850  0.628133  0.907969  0.503826  4.746778  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  0.089688  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.338233 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357 -1.159119
E  0.190794  1.978757  2.605967  0.683509  5.459028 -0.134841

In [21]:
#row 2 values
df.iloc[2]

W        -2.018168
X         0.740122
Y         0.528813
Z        -0.589001
Sum      -1.338233
Random   -1.706086
Name: C, dtype: float64

In [22]:
# to select value in a specific index use iloc
df.iloc[2,2]

0.5288134940893595

In [23]:
df.loc['B','X']

-0.31931804459303326

In [24]:
#Removing a column. Axis=1 is column while axis=0 is for row
df.drop('Sum', axis=1)

          W         X         Y         Z    Random
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [25]:
df

          W         X         Y         Z       Sum    Random
A  2.706850  0.628133  0.907969  0.503826  4.746778  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  0.089688  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.338233 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -0.548357 -1.159119
E  0.190794  1.978757  2.605967  0.683509  5.459028 -0.134841

In [26]:
df.drop('Sum', axis=1, inplace= True)
df

          W         X         Y         Z    Random
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119
E  0.190794  1.978757  2.605967  0.683509 -0.134841

In [27]:
#remove row
df.drop('E', axis=0, inplace=True ) #inplace=true removes permanently

In [28]:
df

          W         X         Y         Z    Random
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119

In [29]:
df.drop('D',axis=0)

          W         X         Y         Z    Random
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086

In [30]:
#copies
df1=df.loc['D']
df1

W         0.188695
X        -0.758872
Y        -0.933237
Z         0.955057
Random   -1.159119
Name: D, dtype: float64

In [31]:
df

          W         X         Y         Z    Random
A  2.706850  0.628133  0.907969  0.503826  0.302665
B  0.651118 -0.319318 -0.848077  0.605965  1.693723
C -2.018168  0.740122  0.528813 -0.589001 -1.706086
D  0.188695 -0.758872 -0.933237  0.955057 -1.159119

In [32]:
df.drop('E',axis = 0)
df

KeyError: "['E'] not found in axis"

In [ ]:
#removing a column
#shows values except those in Y
df1=df.drop(columns='Y')
df1

# Conditional Statement Selection

In [ ]:
df>0

In [ ]:
#Reset index to default 0,1,2,...n index
df.reset_index()

In [ ]:
#adding a column
newId='DE AB CD EF EG'.split()
df.loc['state']=newId
df

In [ ]:
df

In [ ]:
df.drop('state',axis=0, inplace=True)

In [ ]:
df

In [ ]:
#adding row
newIdRow='DE AB CD EF EG'.split()
df.loc['E']=newIdRow

In [ ]:
df

In [ ]:
df.set_index('state',inplace= True)
df

# Merging, Joining, and Concatenation

In [ ]:
#dataframes deals with (data,index,columns)
df3=pd.DataFrame({'A': ['A0','A1','A2','A3' ], 'B':['B0','B1','B2','B3'], 'C':['C0','C1','C2','C3'], 'D':['D0','D1','D2','D3']}, index=[0,1,2,3])

In [ ]:
df3

In [ ]:
df4=pd.DataFrame({'A': ['A4','A5','A6','A7' ], 'B':['B4','B5','B6','B7'], 'C':['C4','C5','C6','C7'], 'D':['D4','D5','D6','D7']}, index=[4,5,6,7])
df4

# Concatenation
You can use **pd.concat** and pass in the list of dataframes to concatenate together

In [ ]:
pd.concat([df3,df4])

In [ ]:
#Concatenate to column- we specify axis=1 but for row we specify axis=0
pd.concat([df3,df4], axis=1)

# Merging
The **merge** function allows you to merge Dataframes together using a similar logic as merging in SQL table together.

In [ ]:
left=pd.DataFrame({'key': ['A0','A1','A2','A3' ], 'B':['B0','B1','B2','B3'], 'C':['C0','C1','C2','C3'], 'D':['D0','D1','D2','D3']}, index=[0,1,2,3])
left

In [ ]:
right=pd.DataFrame({'key': ['A0','A1','A2','A3' ], 'B':['B4','B5','B6','B7'], 'C':['C4','C5','C6','C7'], 'D':['D4','D5','D6','D7']}, index=[4,5,6,7])
right

In [ ]:
pd.merge(left, right, how= 'inner', on='key')

In [ ]:
pd.merge(right, left, how= 'inner', on='key')

# Data Input and Output

In [ ]:
## Loading the csv file
load_csv=pd.read_csv('Cars Revised.csv')

In [ ]:
load_csv

In [ ]:
load_csv.shape

In [ ]:
#returns the fist five values on default but you can specify the number of values by stating the number in the brac;kets e.g.head(3)
load_csv.head()

In [ ]:
#returns last five values in default
load_csv.tail()

In [ ]:
#returns the statistical 
load_csv.describe()

In [ ]:
import seaborn as sns

In [ ]:
sns.heatmap(load_csv.corr())

In [ ]:
#loading excel file
load_excel=pd.read_excel("Form 1 - Average - (2021 Term 3)__16476556816588584.xlsx", sheet_name='Grade Summaries')
load_excel

In [ ]:
# loading the html file
import requests 
from bs4 import BeautifulSoup
load_html=pd.read_html("https://www.must.ac.ke/kuccps-2019-admission-list-2/")
load_html

In [ ]:
page=requests.get("https://www.must.ac.ke/kuccps-2019-admission-list-2/")
soup=BeautifulSoup(page.text,'lxml')
soup

In [ ]:
#getting the table content
table=soup.find('table')
headers=[]
for row in table.find_all('tr')[1:]:
    data=row.find_all('td')
    titles=[td.text.strip() for td in data]
    headers.append(titles)
df =pd.DataFrame(columns=headers)
df

In [ ]:
for row in table.find_all('tr')[1:]:
    row_data=row.find_all('td')
    content=[td.text for td in row_data]
    length=len(df)
    df.loc[length]=content
df

In [ ]:
#saving DataFrame to csv
df.to_csv('2019admission.csv')

In [ ]:
#saving dataframe to excel
df.to_excel("output.xlsx")
df

# Missing Data

In [ ]:
# Create   
dataframe=pd.DataFrame({'A':[1,2, np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,5]})
dataframe

In [ ]:
dataframe.isnull()

In [ ]:
#No. of missing values columnwise
dataframe.isnull().sum()

In [ ]:
#Number of missing values==you can use isnull() or isna(). row and column
dataframe.isnull().sum().sum()

## Methods of dealing with null values
1 drop null values

In [ ]:
# dropping the null values
dataframe.dropna()

In [ ]:
# Drop columnwise by default axis=0 hence only removes rows
dataframe.dropna(axis=1)

In [ ]:
# returns dataframe with 2 or more non-null values
dataframe.dropna(thresh=2)

In [ ]:
dataframe.dropna(thresh=2, axis=1)

### 2. filling the null value with specified value

In [ ]:
### filling the null with " fill value"
dataframe.fillna(value=0.5)

## The replace() method
#You can replace the Nan values in a specific column with mean, median , mode, or any other value

In [ ]:
#replace null values with the mean
df['A'].replace([numpy.nan], df[A].mean, inplace=True)

## 3. fill with mean, median, mode

In [ ]:
dataframe2=pd.DataFrame({'A':[1,2, np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,5]})

In [ ]:
#Fill with mean depending in row or column
dataframe2['A'].fillna(value=dataframe2['A'].mean())

In [ ]:
#fill null values on a specific row or column
dataframe2['B'].fillna(value=2)

In [ ]:
#Fill with median depending in row or column
dataframe2['A'].fillna(value=dataframe2['A'].median())

In [ ]:
#Fill with mean depending in row or column
dataframe2['A'].fillna(value=dataframe2['A'].mode()[0])

## 4. interpolating method

In [ ]:
dataframe2.interpolate()

In [ ]:
dataframe3=pd.DataFrame({'A':[1,2, np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,5]})
dataframe3

In [ ]:
dataframe3.interpolate(method='polynomial', order=2)

## 5. Replacing missing values with last known ``forward filling`` and ``backward filling``

In [ ]:
## Forward filling (last known value)
dataframe5=dataframe3.ffill()
dataframe5

In [ ]:
## backward filling (latest known value)
dataframe6=dataframe3.bfill()
dataframe6

## GroupBy

In [35]:
#Create dataframe 
data = pd.DataFrame({'Company':['Google', 'Google', 'Microsoft', 'Microsoft', 'Facebook', 'Facebook'], 'Person':['Chacha', 'Omondi','Nathan', 'Mathew','Passy', 'Ezekiel'], 'Sales':[200,450,350,220,520,128]})
data

     Company   Person  Sales
0     Google   Chacha    200
1     Google   Omondi    450
2  Microsoft   Nathan    350
3  Microsoft   Mathew    220
4   Facebook    Passy    520
5   Facebook  Ezekiel    128

## Now we can use``groupby()``method to group rows together based on their column name

In [36]:
by_Company = data.groupby('Company')
by_Company

In [37]:
by_Company.mean()

           Sales
Company
Facebook     324
Google       325
Microsoft    285

In [38]:
by_Company.std()

                Sales
Company
Facebook   277.185858
Google     176.776695
Microsoft   91.923882

In [39]:
by_Company.min()

            Person  Sales
Company
Facebook   Ezekiel    128
Google      Chacha    200
Microsoft   Mathew    220

In [40]:
by_Company.max()

           Person  Sales
Company
Facebook    Passy    520
Google     Omondi    450
Microsoft  Nathan    350

In [41]:
by_Company.describe()

          Sales
          count   mean         std    min    25%    50%    75%    max
Company
Facebook    2.0  324.0  277.185858  128.0  226.0  324.0  422.0  520.0
Google      2.0  325.0  176.776695  200.0  262.5  325.0  387.5  450.0
Microsoft   2.0  285.0   91.923882  220.0  252.5  285.0  317.5  350.0

In [42]:
by_Company.count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [45]:
#Transpose Rotates the table by 180 degrees
by_Company.describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   324.000000  325.000000  285.000000
      std    277.185858  176.776695   91.923882
      min    128.000000  200.000000  220.000000
      25%    226.000000  262.500000  252.500000
      50%    324.000000  325.000000  285.000000
      75%    422.000000  387.500000  317.500000
      max    520.000000  450.000000  350.000000

In [47]:
by_Company.describe().transpose()['Google']

Sales  count      2.000000
       mean     325.000000
       std      176.776695
       min      200.000000
       25%      262.500000
       50%      325.000000
       75%      387.500000
       max      450.000000
Name: Google, dtype: float64